from django.core.management.base import BaseCommand
from planApp.models import StrategicGoal, MainGoal, KPI
from userApp.models import User, Sector

class Command(BaseCommand):
    help = 'Seed data for Strategic Goals, Main Goals, and KPIs'

    def handle(self, *args, **kwargs):
        # Create Strategic Goals
        strategic_goals = [
            {"name": "ተቋማዊ የማስፈጸም አቅም፣ የሀብት አጠቃቀም እና የአገልግሎት አሰጣጥ አሰራር ማጎልበት", "weight": 25},
            {"name": "ለአርቲፊሻል ኢንተለጀንስ ምርምር እና ልማት ዳታን ማሰበሰብ፣ ማዘጋጀት እና  አጠቃቅምን  ማጎልበት", "weight": 25},
            {"name": "ችግር ፈቺ የአርቲፊሻል ኢንተለጀንስ ምርምሮችን ማከናወን፣ ማልማት እና ተደራሽ ማድረግ ", "weight": 25},
            {"name": "ሀገራዊ የአርቲፊሻል ኢንተሊጀንስ መሠረተ-ልማት በመገንባት ስራ ላይ ማዋል እና የዘርፉን ስነ-ምህዳር ማጎልበት", "weight": 25}
        ]

        for sg_data in strategic_goals:
            sg, _ = StrategicGoal.objects.get_or_create(name=sg_data["name"], defaults={"weight": sg_data["weight"]})
            
            # Create Main Goals under each Strategic Goal
            if sg_data["name"] == "ተቋማዊ የማስፈጸም አቅም፣ የሀብት አጠቃቀም እና የአገልግሎት አሰጣጥ አሰራር ማጎልበት":
                main_goals = [
                    {"name": "የዕቅድ ዝግጅት፣ የክትትልና ግምገማ እና የስታቲስቲክስ መረጃ አስተዳደር አሰራር ማሻሻል", "weight": 3.125},
                    {"name": "የሰው ሀብት ልማት እና አስተዳደር አሰራርና ውጤታማነት ማሻሻል", "weight": 3.125},
                    {"name": "የፋይናንስና ንብረት አስተዳደር አሰራርንና ውጤታማነትን ማሻሻል", "weight": 3.125},
                    {"name": "የኢንፎርሜሽን፣ ኮሙኒኬሽን እና ቴክኖሎጂ አሰራርንና ውጤታማነትን ማሻሻል", "weight": 3.125},
                    {"name": "የአጋርነት እና የህዝብ ግንኙነት አስራርንና ውጤታማነትን ማሻሻል", "weight": 3.125},
                    {"name": "የስነ ምግባርና ፀረ ሙስና የክትትል ሥራዎችን ማሻሻል", "weight": 3.125},
                    {"name": "የሴቶችና ማሕበራዊ ተሳታፊነትንና ተጠቃሚነትን ማሻሻል", "weight": 3.125},
                    {"name": "የበጎ አድራጎት እና የማህበረሰብ አገልግሎት ሥራዎችን ማሻሻል", "weight": 3.125}
                ]
            elif sg_data["name"] == "ለአርቲፊሻል ኢንተለጀንስ ምርምር እና ልማት ዳታን ማሰበሰብ፣ ማዘጋጀት እና  አጠቃቅምን  ማጎልበት":
                main_goals = [
                    {"name": "ለአኢ ምርምርና ልማት ዳታዎችን መሰብሰብ", "weight": 6.25},
                    {"name": "ለምርምር እና ልማት ዳታሴቶችን ዝግጁ ማድረግ", "weight": 6.25},
                    {"name": "የቢግ ዳታ ትንተና ማከናወን", "weight": 6.25},
                    {"name": "የአኢ ዳታ አጠቃቀምን ማሳደግ", "weight": 6.25}
                ]
            elif sg_data["name"] == "ችግር ፈቺ የአርቲፊሻል ኢንተለጀንስ ምርምሮችን ማከናወን፣ ማልማት እና ተደራሽ ማድረግ":
                main_goals = [
                    {"name": "በተለያዩ ዘርፎች ምርምሮችን ማካሔድ", "weight": 12.5},
                    {"name": "በተለያዩ ዘርፎች ምርምሮችን ማልማት", "weight": 12.5}
                ]
            elif sg_data["name"] == "ሀገራዊ የአርቲፊሻል ኢንተሊጀንስ መሠረተ-ልማት በመገንባት ስራ ላይ ማዋል እና የዘርፉን ስነ-ምህዳር ማጎልበት":
                main_goals = [
                    {"name": "ደረጃዉን የጠበቀ የአ.ኢ መሰረተ-ልማት መገንባት እና ማደራጀት", "weight": 3.57},
                    {"name": "የአኢ ቁሶችን መዘርጋት እና መከታተል", "weight": 3.57},
                    {"name": "የድጋፍና የቁጥጥር ስርዓት መዘርጋት", "weight": 3.57},
                    {"name": "ለጀማሪ ተመራማሪዎችና አልሚዎች ምቹ ምህዳር መፍጠር", "weight": 3.57},
                    {"name": "ሀገራዊ የአኢ ፕሮጀክቶችን መከወን፣ መከታተልና መደገፍ", "weight": 3.57},
                    {"name": "ከትምህርትና ስልጠና ተቋማት ጋር በመቀናጀት ብቁ የሰው ሀይል ማፍራት", "weight": 3.57},
                    {"name": "ሀገራዊና አለም አቀፋዊ ሁነቶችን ማዘጋጀት", "weight": 3.57}
                ]
            for mg_data in main_goals:
                mg, _ = MainGoal.objects.get_or_create(name=mg_data["name"], weight= mg_data["weight"], strategic_goal_id=sg)

                # Create KPIs under each Main Goal
                if mg_data["name"] == "የዕቅድ ዝግጅት፣ የክትትልና ግምገማ እና የስታቲስቲክስ መረጃ አስተዳደር አሰራር ማሻሻል":
                    kpis = [
                        {"name": "ወቅቱንና ጥራቱን የጠበቀ ዕቅድና ሪፖርት ሰነድ ማዘጋጅት"},
                        {"name": "የክትትልና ግምገማ ስርዓት መዘርጋት"},
                        {"name": "የዘርፉን የአፈጻጸም መረጃ አያያዝ በቴክኖሎጂ በመደገፍ በሙከራ ደረጃ ማደራጀት"}
                    ]
                elif mg_data["name"] == "የሰው ሀብት ልማት እና አስተዳደር አሰራርና ውጤታማነት ማሻሻል":
                    kpis = [
                        {"name": "ግልጽነት የሰፈነበት የሰው ኃይል ስምሪት ማካሄድ"},
                        {"name": "ለአመራር እና ለሰራተኞች የሚሰጡ ሥልጠናዎችን ማሳደግ"},
                        {"name": "የውስጥ የማበረታቻ ስርዓት መዘርጋት"},
                        {"name": "የሰራተኛ እርካታን በማሳደግ ፍልሰትን መቀነስ"}
                    ]
                elif mg_data["name"] == "የፋይናንስና ንብረት አስተዳደር አሰራርንና ውጤታማነትን ማሻሻል":
                    kpis = [
                        {"name": "የተመደበ በጀት በአግባቡ ሥራ ላይ ማዋል (ድርሻ)"},
                        {"name": "ነቀፌታ ያለበትን የኦዲት ግኝት መቀነስ"},
                        {"name": "የመንግስት ኤሌክትሮኒክ ክፍያን ድርሻ ማሳደግ"},
                        {"name": "የመንግስት ኤሌክትሮኒክ ግዢን ድርሻ ማሳደግ"},
                        {"name": "መሰረታዊ አገልግሎትን በቅልጥፍና በመስጠት የደንበኞችን እርካታ ማሻሻል"},
                        {"name": "የንብረት አያያዝ እና የጥገና ወጪዎችን መቀነስ"}
                    ]
                elif mg_data["name"] == "የኢንፎርሜሽን፣ ኮሙኒኬሽን እና ቴክኖሎጂ አሰራርንና ውጤታማነትን ማሻሻል":
                    kpis = [
                        {"name": "መረጃ ቋት ማደራጀት"},
                        {"name": "በተቋሙ ወረቀት አልባ አሰራርን መተግበር"},
                        {"name": "በተቋሙ የሚሰጠ አገልግሎቶችን ኦቶሜት ማድረግ"},
                        {"name": "የተገልጋዮችን እርካታ ደረጃ ማሳደግ"},
                    ]
                elif mg_data["name"] == "የአጋርነት እና የህዝብ ግንኙነት አስራርንና ውጤታማነትን ማሻሻል":
                    kpis = [
                        {"name": "ለተቋም አቅም ግንባታ በሀገር ውስጥ አጋርነት የተገኘ ድጋፍ"},
                        {"name": "ለተቋም አቅም ግንባታ በውጭ ሀገር አጋርነት የተገኘ ድጋፍ"},
                        {"name": "መረጃዎችን በተለያዩ የተግባቦት ዘዴዎች ተደራሽ ማድረግ"},
                    ]
                elif mg_data["name"] == "የስነ ምግባርና ፀረ ሙስና የክትትል ሥራዎችን ማሻሻል":
                    kpis = [
                        {"name": "ለብልሹ አሰራር የተጋለጡ አሰራሮች በጥናት በመለየት የማሻሻያ ሀሳብ ማቅረብ"},
                        {"name": "በብልሹ አሰራር ዙርያ ጥቆማ ከተደረገባቸው ውስጥ ማስተካከያ የተደረገባቸው"},
                        {"name": "የሀብት ምዝገባ ያካሄዱ አመራሮች እና ባለሞያዎች  ድርሻ ማሳደግ"}
                    ]
                elif mg_data["name"] == "የሴቶችና ማሕበራዊ ተሳታፊነትንና ተጠቃሚነትን ማሻሻል":
                    kpis = [
                        {"name": "የህጻናት ማቆያ አገልግሎት ተጠቃሚ ሴት ሰራተኞች ብዛት ማሳደግ"},
                        {"name": "ወደ አመራር የመጡ ሴት ሰራተኞች ብዛት ማሳደግ"},
                        {"name": "ሥልጠና ያገኙ ሴት ሰራተኞች ድርሻ ማሳደግ"},
                        {"name": "ለአካል ጉዳተኛ ሰራተኞችና ተገልጋዮች ምቹ የስራ ሁኔታና ቦታ መፍጠር"},
                    ]
                elif mg_data["name"] == "የበጎ አድራጎት እና የማህበረሰብ አገልግሎት ሥራዎችን ማሻሻል":
                    kpis = [
                        {"name": "የአረንጓዴ አሻራ ተግባራትን ማካሄድ/ችግኞችን መትከል"},
                        {"name": "የአቅመ ደካማ ማህበረሰቦች የመኖሪያ ቤቶች መገንባት"},
                        {"name": "የአቅመ ደካማ ማህበረሰቦች የመኖሪያ ቤቶች መገንባት"},
                        {"name": "የአቅመ ደካማ ቤተሰብ ተማሪዎች ድጋፍ"},
                        {"name": "የአቅመ ደካማ ቤተሰብ ተማሪዎች ድጋፍ"},
                        {"name": "ለተለያዩ ማህበራዊ ቀውሶች የተደረገ ድጋፍ"},
                        {"name": "ለተለያዩ ማህበራዊ ቀውሶች የተደረገ ድጋፍ"},
                        {"name": "የተደረገ ደም ልገሳ (ድርሻ ከሰራተኛ ብዛት)"},
                        {"name": "ወላጆቻቸውን ያጡ ህፃናትን መደገፍ"},
                        {"name": "ወላጆቻቸውን ያጡ ህፃናትን መደገፍ"},
                    ]
                elif mg_data["name"] == "ለአኢ ምርምርና ልማት ዳታዎችን መሰብሰብ":
                    kpis = [
                        {"name": "የተሰበሰበ ዳታ"},
                    ]
                elif mg_data["name"] == "ለምርምር እና ልማት ዳታሴቶችን ዝግጁ ማድረግ":
                    kpis = [
                        {"name": "የተዘጋጀ ዳታ "},
                        {"name": "የተዘጋጀ ዳታ ሴት"}
                    ]
                elif mg_data["name"] == "የቢግ ዳታ ትንተና ማከናወን":
                    kpis = [
                        {"name": "ቢግ ዳታን በመጠቀም የተተነተነ ዳታ ሴት)"},
                    ]
                elif mg_data["name"] == "የአኢ ዳታ አጠቃቀምን ማሳደግ":
                    kpis = [
                        {"name": "ተደራሽ የተደረገ ዳታ ሴት"},
                        {"name": "ጥቅም ላይ የዋለ ዳታ ሴት"},
                    ]
                elif mg_data["name"] == "በተለያዩ ዘርፎች ምርምሮችን ማካሔድ":
                    kpis = [
                        {"name": "የተካሔዱ ምርምሮች"},
                        {"name": "ፓተንት ያገኙ የምርምር ውጤቶች"},
                        {"name": "በጆርናል የታተሙ የምርምር ዉጤቶች"},
                    ]
                elif mg_data["name"] == "በተለያዩ ዘርፎች ምርምሮችን ማልማት":
                    kpis = [
                        {"name": "የለሙ ምርምሮች"},
                        {"name": "ወደ ስራ የተሸጋገሩ ምርመሮች"},
                        {"name": "የኢንቨስትመንት አዎንታዊ ምላሽ (አዋጪነት)"},
                        {"name": "የተጠቃሚዎች ከቴክኖሎጂዉ ጋር የመላመድ ደረጃ"},
                        {"name": "የተከናወነ የቴክኖሎጂ ተፅዕኖ ግምገማ"},
                    ]
                elif mg_data["name"] == "ደረጃዉን የጠበቀ የአ.ኢ መሰረተ-ልማት መገንባት እና ማደራጀት":
                    kpis = [
                        {"name": "የተገነባ የአርቲፊሻል ኢንተለጀንስ መሰረተ ልማት"},
                        {"name": "ፋሲሊቲ የተሞላለት የአርቲፊሻል ኢንተለጀንስ መሰረተ ልማት"},
                        {"name": "አለም አቀፍ እዉቅና ያገኘ የዳታ ማዕከል"},
                        {"name": "በክላዉድ ሰርቪስ ዳታ ማዕከሉን እየተጠቀሙ ያሉ ተቋማት"}
                    ]
                elif mg_data["name"] == "የአኢ ቁሶችን መዘርጋት እና መከታተል":
                    kpis = [
                        {"name": "የአኢ ቁሶችን ሽፋን ያገኙ ከተሞች"},
                        {"name": "የአኢ ቁሶችን ሽፋን ያገኙ ተቋማት"},
                        {"name": "የተሰጠ የጥገና አገልግሎት"},
                        {"name": "የተሰጠ የጥገና አገልግሎት ፍጥነት በሰአት"},
                    ]
                elif mg_data["name"] == "የድጋፍና የቁጥጥር ስርዓት መዘርጋት":
                    kpis = [
                        {"name": "የጸደቀና ተግባራዊ የተደረገ የአኢ ፖሊሲ"},
                        {"name": "የጸደቀና ተግባራዊ የተደረገ የአኢ ቴክኖሎጂ ልማት ቁጥጥር ስርአት አዋጅ"},
                        {"name": "የተዘረጋ የዳታ አጠቃቀም ስርአት"},
                        {"name": "የተዘጋጀ የመሰረተ-ልማት አጠቃቀም ስርአት"},
                    ]
                elif mg_data["name"] == "ለጀማሪ ተመራማሪዎችና አልሚዎች ምቹ ምህዳር መፍጠር":
                    kpis = [
                        {"name": "ድጋፍ የተመቻቸላቸዉ የፈጠራ ሀሳብ ያላቸዉ ግለሰቦች"},
                        {"name": "ተቋማት ጋር ትስስር የተፈጠረላቸዉ ጀማሪዎች"},
                        {"name": "ድጋፍ የተደረገላቸዉ በጀማሪዎች"},
                    ]
                elif mg_data["name"] == "ሀገራዊ የአኢ ፕሮጀክቶችን መከወን፣ መከታተልና መደገፍ":
                    kpis = [
                        {"name": "በዘርፉ የተከናወኑ ፕሮጀክቶች"},
                        {"name": "በጊዜ፣ በጥራትና በተያዘለት በጀት የተጠናቀቁ ፕሮጀክቶች"},
                        {"name": "የፕሮጀክቶቹ ተጠቃሚዎች የመላመድ ደረጃ"},
                        {"name": "የበለጸጉ የተቋሙን የውስጥ አሰራር የሚያዘምኑ ሲስተሞች"},
                    ]
                elif mg_data["name"] == "ከትምህርትና ስልጠና ተቋማት ጋር በመቀናጀት ብቁ የሰው ሀይል ማፍራት":
                    kpis = [
                        {"name": "ከከፍተኛ ትምህርት ተቋማት ጋር በመቀናጀት የተቀረጸ ካሪኩለም"},
                        {"name": "በተቀረጹ ካሪኩለሞች የትምህርት እድል ያገኙ ተመራማሪዎች"},
                        {"name": "በጸደቀ ካሪኩለም ላይ የተደረገ ድጋፍና ክትትል"},
                        {"name": "የስልጠና ድጋፍ ያገኙ ታዳጊዎች"}
                    ]
                elif mg_data["name"] == "ሀገራዊና አለም አቀፋዊ ሁነቶችን ማዘጋጀት":
                    kpis = [
                        {"name": "የተዘጋጀ ሁነት"},
                        {"name": "በሁነቶች ላይ የተሳተፈ ባለድርሻ አካላት ብዛት"},
                        {"name": "በሁነቱ አማካኝነት የተፈጠረ ትስስር እና ትብብር"},
                    ]
                else:
                    kpis = []
                
                for kpi_data in kpis:
                    KPI.objects.get_or_create(name=kpi_data["name"], main_goal_id=mg)
        
        self.stdout.write(self.style.SUCCESS('Successfully seeded Strategic Goals, Main Goals, and KPIs'))
